blog/how-to-install-php-environment-on-docker.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>如何在docker上安装php环境</title>
<!-- 2020-11-21 Sat 17:43 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Siqing Mu" />
<link rel="shortcut icon" href="https://www.khow.me/blog/images/favicon.ico" /><link rel="stylesheet" type="text/css" href="./css/site.css" />
</head>
<body>
<div id="content">
<h1 class="title">如何在docker上安装php环境</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 安装步骤</a></li>
<li><a href="#sec-2">2. 进入系统之后的安装</a></li>
<li><a href="#sec-3">3. nginx 配置的一些注意点</a></li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 安装步骤</h2>
<div class="outline-text-2" id="text-1">
<p>
创建并启动容器
</p>
<pre class="example">
docker run -it -d --name lnmp -p 8080:80 -v ~/workspace:/usr/local/src/ debian
</pre>

<p>
参数解释
</p>
<pre class="example">
docker run：开始运行一个容器
-it 参数：-i：交互式执行容器。-t：分配虚拟终端。一般搭配使用。
-d 参数：容器以后台运行并输出容器ID。
-–name 参数：给容器分配一个识别符，方便将来的启动，停止，删除等操作。
-p 参数：容器的80端口映射到本机的8080 端口。
-v 参数：挂载卷（volume），冒号后面是容器的路径，冒号前面是宿主机的路径。
</pre>
<p>
一些常用命令
</p>
<pre class="example">
docker ps -as
docker images
docker stop $name
docker start $name
docker restart $name
docker rm $name
docker stats --no-stream
</pre>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 进入系统之后的安装</h2>
<div class="outline-text-2" id="text-2">
<p>
执行进入容器
</p>
<pre class="example">
docker exec -it lnmp /bin/bash
</pre>

<p>
常用工具安装
</p>
<pre class="example">
apt-get update &amp;&amp; apt-get install -y wget vim curl procps lsb-release apt-transport-https ca-certificates
</pre>

<p>
添加sury php ppa 仓库
</p>
<pre class="example">
wget -O /etc/apt/trusted.gpg.d/php.gpg https://packages.sury.org/php/apt.gpg
echo "deb https://packages.sury.org/php/ $(lsb_release -sc) main" | tee /etc/apt/sources.list.d/php.list
</pre>

<p>
安装php
</p>
<pre class="example">
apt-get update &amp; apt-get install -y php7.4
</pre>

<p>
安装php扩展
</p>
<pre class="example">
apt-get install php7.4-xxx
apt-get install php7.4-{bcmath,bz2,intl,gd,mbstring,mysql,zip,curl}
</pre>

<p>
安装php-fpm扩展及nginx
</p>
<pre class="example">
apt-get install nginx php7.4-fpm
</pre>

<p>
启动
</p>
<pre class="example">
/etc/init.d/nginx start
/etc/init.d/php7.4-fpm start
</pre>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> nginx 配置的一些注意点</h2>
<div class="outline-text-2" id="text-3">
<p>
美化URI
</p>
<pre class="example">
location / {
    try_files $uri $uri/ /index.php?$query_string;
}
</pre>

<p>
nginx配置fastcgi_pass可能和php版本不一致，需要去php pool里去查看对应设置。
</p>


<p>
reference: <a href="https://computingforgeeks.com/how-to-install-latest-php-on-debian/">https://computingforgeeks.com/how-to-install-latest-php-on-debian/</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<div id="disqus_thread"></div>
            <script type="text/javascript">
            var disqus_shortname = 'seymer';
            (function() {
                    var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
                    dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
                    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
                    })();
            </script>
            <script>
              (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
                      (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
                      m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
                      })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

              ga('create', 'UA-110114842-1', 'auto');
              ga('send', 'pageview');
            </script>
</div>
</body>
</html>